spec/support/vcr_cassettes/mpi/find_candidate/valid_icn_without_ni.yml

---
http_interactions:
- request:
    method: post
    uri: "<MPI_URL>"
    body:
      encoding: ASCII-8BIT
      base64_string:
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTliODQ1MjQxLWM0YTMtNDUwNi1hMzcyLTU3ZGE4MTA4YzRk
        MCIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE4MDIyMTIwMTkw
        MSIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8cXVlcnlCeVBhcmFtZXRl
        cj4KICAgICAgICAgIDxxdWVyeUlkIHJvb3Q9IjEuMi44NDAuMTE0MzUwLjEu
        MTMuMjguMS4xOC41Ljk5OSIgZXh0ZW5zaW9uPSIxODIwNCIvPgogICAgICAg
        ICAgPHN0YXR1c0NvZGUgY29kZT0ibmV3Ii8+CiAgICAgICAgICA8bW9kaWZ5
        Q29kZSBjb2RlPSJNVkkuQ09NUDIiLz4KICAgICAgICAgIDxpbml0aWFsUXVh
        bnRpdHkgdmFsdWU9IjEiLz4KICAgICAgICAgIDxwYXJhbWV0ZXJMaXN0Pgog
        ICAgICAgICAgICA8aWQgcm9vdD0iMi4xNi44NDAuMS4xMTM4ODMuNC4zNDki
        IGV4dGVuc2lvbj0iMTAwODcxNDcwMVY0MTYxMTEiLz4KICAgICAgICAgIDwv
        cGFyYW1ldGVyTGlzdD4KICAgICAgICA8L3F1ZXJ5QnlQYXJhbWV0ZXI+CiAg
        ICAgIDwvY29udHJvbEFjdFByb2Nlc3M+CiAgICA8L2lkbTpQUlBBX0lOMjAx
        MzA1VVYwMj4KICA8L2VudjpCb2R5Pgo8L2VudjpFbnZlbG9wZT4KCjxlbnY6
        RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMueG1sc29h
        cC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDovL3d3dy53
        My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDovL3NjaGVt
        YXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhzaT0iaHR0
        cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiPgogIDxl
        bnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFfSU4yMDEz
        MDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52YS5nb3Yi
        IHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWHi
        gJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw34oCQb3Jn
        OnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNoZXNjaGVt
        YXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhsN+KAkG9y
        Zzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCByb290PSIx
        LjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9uPSIyMDBW
        R09WLTliODQ1MjQxLWM0YTMtNDUwNi1hMzcyLTU3ZGE4MTA4YzRkMCIvPgog
        ICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE4MDIyMTIwMTkwMSIvPgog
        ICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxpbnRlcmFj
        dGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0ZW5zaW9u
        PSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2luZ0NvZGUg
        Y29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNvZGU9IlQi
        Lz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAgICAgPHJl
        Y2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2UgY2xhc3ND
        b2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAgICAgICAg
        ICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0IiBleHRl
        bnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAgPC9yZWNl
        aXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAgICAgICA8
        ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0iSU5TVEFO
        Q0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjQu
        MzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2RldmljZT4K
        ICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2VzcyBjbGFz
        c0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxjb2RlIGNv
        ZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2Ljg0MC4x
        LjExMzg4My4xLjYiLz4KICAgICAgICA8cXVlcnlCeVBhcmFtZXRlcj4KICAg
        ICAgICAgIDxxdWVyeUlkIHJvb3Q9IjEuMi44NDAuMTE0MzUwLjEuMTMuMjgu
        MS4xOC41Ljk5OSIgZXh0ZW5zaW9uPSIxODIwNCIvPgogICAgICAgICAgPHN0
        YXR1c0NvZGUgY29kZT0ibmV3Ii8+CiAgICAgICAgICA8bW9kaWZ5Q29kZSBj
        b2RlPSJNVkkuQ09NUDEuUk1TIi8+CiAgICAgICAgICA8aW5pdGlhbFF1YW50
        aXR5IHZhbHVlPSIxIi8+CiAgICAgICAgICA8cGFyYW1ldGVyTGlzdD4KICAg
        ICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjQuMzQ5IiBl
        eHRlbnNpb249IjEwMDg3MTQ3MDFWNDE2MTExIi8+CiAgICAgICAgICA8L3Bh
        cmFtZXRlckxpc3Q+CiAgICAgICAgPC9xdWVyeUJ5UGFyYW1ldGVyPgogICAg
        ICA8L2NvbnRyb2xBY3RQcm9jZXNzPgogICAgPC9pZG06UFJQQV9JTjIwMTMw
        NVVWMDI+CiAgPC9lbnY6Qm9keT4KPC9lbnY6RW52ZWxvcGU+Cg==
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Wed, 21 Feb 2018 20:19:01 GMT
      Content-Length:
      - '1888'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Tue, 20 Aug 2019 19:53:09 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=dOOwlx5FDrAgaD5XNRjONrinSinThzCvRKo_0VNzcvphEacC_NBa!1741642591;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - 4bae058f5d5c4fa506c853c2
    body:
      encoding: UTF-8
      string:
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
          <env:Header/>
          <env:Body>
            <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
              xmlns:idm="http://vaww.oed.oit.va.gov"
              xmlns="urn:hl7-org:v3">
              <id extension="WSDOC1908201553094460697640189" root="2.16.840.1.113883.4.349"/>
              <creationTime value="20190820155309"/>
              <versionCode code="4.1"/>
              <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="NE"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200M" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                  <id extension="200VGOV-9b845241-c4a3-4506-a372-57da8108c4d0" root="1.2.840.114350.1.13.0.1.7.1.1"/>
                </targetMessage>
              </acknowledgement>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
                <subject typeCode="SUBJ">
                  <registrationEvent classCode="REG" moodCode="EVN">
                    <id nullFlavor="NA"/>
                    <statusCode code="active"/>
                    <subject1 typeCode="SBJ">
                      <patient classCode="PAT">
                        <id extension="1008714701V416111^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                        <id extension="796122306^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="9100792239^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="1008714701^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                        <id root="2.16.840.1.113883.4.349" extension="32383600^PI^200CORP^USVBA^L"/>
                        <statusCode code="active"/>
                        <patientPerson>
                          <name use="L">
                            <given>MITCHELL</given>
                            <given>G</given>
                            <family>JENKINS</family>
                          </name>
                          <administrativeGenderCode code="M"/>
                          <birthTime value="19490304"/>
                          <addr use="PHYS">
                            <streetAddressLine>121 A St</streetAddressLine>
                            <city>Austin</city>
                            <state>TX</state>
                            <postalCode>78772</postalCode>
                            <country>USA</country>
                          </addr>
                          <asOtherIDs classCode="SSN">
                            <id extension="796122306" root="2.16.840.1.113883.4.1"/>
                            <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                              <id root="1.2.840.114350.1.13.99997.2.3412"/>
                            </scopingOrganization>
                          </asOtherIDs>
                        </patientPerson>
                        <subjectOf1>
                          <queryMatchObservation classCode="COND" moodCode="EVN">
                            <code code="IHE_PDQ"/>
                            <value nullFlavor="NA" xsi:type="INT"/>
                          </queryMatchObservation>
                        </subjectOf1>
                      </patient>
                    </subject1>
                    <custodian typeCode="CST">
                      <assignedEntity classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.4.349"/>
                      </assignedEntity>
                    </custodian>
                  </registrationEvent>
                </subject>
                <queryAck>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <queryResponseCode code="OK"/>
                  <resultCurrentQuantity value="1"/>
                </queryAck>
                <queryByParameter>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <statusCode code="new"/>
                  <modifyCode code="MVI.COMP1.RMS"/>
                  <initialQuantity value="1"/>
                  <parameterList>
                    <id extension="1008714701V416111" root="2.16.840.1.113883.4.349"/>
                  </parameterList>
                </queryByParameter>
              </controlActProcess>
            </idm:PRPA_IN201306UV02>
          </env:Body>
        </env:Envelope>
    http_version: 
  recorded_at: Wed, 21 Feb 2018 20:19:01 GMT
recorded_with: VCR 3.0.3
